#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_networking_floatingip_v2.fip: Refreshing state... [id=1a2e1285-0a20-4582-aab9-27255607a862]
openstack_compute_secgroup_v2.secgroup: Refreshing state... [id=47779555-2ce1-400c-ba68-d177683c7228]
openstack_compute_instance_v2.dashboard: Refreshing state... [id=511ed2f8-ee62-45e9-b4b5-1f05dd9604c7]
openstack_compute_floatingip_associate_v2.fip: Refreshing state... [id=147.213.76.217/511ed2f8-ee62-45e9-b4b5-1f05dd9604c7/]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # openstack_networking_floatingip_v2.fip has been changed
  ~ resource "openstack_networking_floatingip_v2" "fip" {
      ~ fixed_ip  = "192.168.10.37" -> "192.168.10.85"
        id        = "1a2e1285-0a20-4582-aab9-27255607a862"
      ~ port_id   = "db436374-a08d-4d43-9642-a85b461c57ad" -> "a807c68b-9010-467c-82f0-49cf0aa74a60"
        tags      = []
        # (4 unchanged attributes hidden)
    }
  # openstack_compute_instance_v2.dashboard has been changed
  ~ resource "openstack_compute_instance_v2" "dashboard" {
        id                  = "511ed2f8-ee62-45e9-b4b5-1f05dd9604c7"
        name                = "dashboard"
      + tags                = []
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_floatingip_associate_v2.fip must be replaced
-/+ resource "openstack_compute_floatingip_associate_v2" "fip" {
      ~ id          = "147.213.76.217/511ed2f8-ee62-45e9-b4b5-1f05dd9604c7/" -> (known after apply)
      ~ instance_id = "511ed2f8-ee62-45e9-b4b5-1f05dd9604c7" -> (known after apply) # forces replacement
      + region      = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # openstack_compute_instance_v2.dashboard must be replaced
-/+ resource "openstack_compute_instance_v2" "dashboard" {
      ~ access_ip_v4        = "192.168.10.85" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_name         = "m1.medium" -> (known after apply)
      ~ id                  = "511ed2f8-ee62-45e9-b4b5-1f05dd9604c7" -> (known after apply)
      ~ image_name          = "Ubuntu-20.04-20211006" -> (known after apply)
        name                = "dashboard"
      + region              = (known after apply)
      - tags                = [] -> null
      ~ user_data           = "d4c8505f3f0b43827f55116a540e6408c4cbcfad" -> "e5783927810fa151d550730fea0e615020d781e4" # forces replacement
        # (6 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.10.85" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:50:c5:66" -> (known after apply)
          ~ name           = "private-network" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @enolfc, Action: `pull_request`*